In [10]:
import pandas as pd
import numpy as np
import re

# Load dataset
df = pd.read_csv("C:/Users/cw/Downloads/Real Estate Data V21.csv")

df.head()

,Name,Property Title,Price,Location,Total_Area,Price_per_SQFT,Baths,Balcony
0,Casagrand ECR 14,"4 BHK Flat for sale in Kanathur Reddikuppam, C...",₹1.99 Cr,"Kanathur Reddikuppam, Chennai",2583,7700,4,Yes
1,"Ramanathan Nagar, Pozhichalur,Chennai",10 BHK Independent House for sale in Pozhichal...,₹2.25 Cr,"Ramanathan Nagar, Pozhichalur,Chennai",7000,3210,6,Yes
2,DAC Prapthi,"3 BHK Flat for sale in West Tambaram, Chennai",₹1.0 Cr,"Kasthuribai Nagar, West Tambaram,Chennai",1320,7580,3,No
3,"Naveenilaya,Chepauk, Triplicane,Chennai",7 BHK Independent House for sale in Triplicane...,₹3.33 Cr,"Naveenilaya,Chepauk, Triplicane,Chennai",4250,7840,5,Yes
4,VGN Spring Field Phase 1,"2 BHK Flat for sale in Avadi, Chennai",₹48.0 L,"Avadi, Chennai",960,5000,3,Yes

In [11]:
# 1) Shape
df.shape

(14528, 8)

In [12]:
# 2) Info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14528 entries, 0 to 14527
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            14528 non-null  object
 1   Property Title  14528 non-null  object
 2   Price           14528 non-null  object
 3   Location        14528 non-null  object
 4   Total_Area      14528 non-null  int64
 5   Price_per_SQFT  14528 non-null  int64
 6   Baths           14528 non-null  int64
 7   Balcony         14528 non-null  object
dtypes: int64(3), object(5)
memory usage: 908.1+ KB

In [14]:
# 3) Null values
print(df.isnull().sum())

Name              0
Property Title    0
Price             0
Location          0
Total_Area        0
Price_per_SQFT    0
Baths             0
Balcony           0
dtype: int64

In [ ]:
# 4) Duplicates
print(df.duplicated().sum())
df[df.duplicated()]

195

,Name,Property Title,Price,Location,Total_Area,Price_per_SQFT,Baths,Balcony
163,MP Silver Bells,"2 BHK Flat for sale in Kundrathur, Chennai",₹45.0 L,"Kundrathur, Chennai",711,6330,2,No
251,"Manthope Colony, Ashok Nagar,Chennai","2 BHK Flat for sale in Ashok Nagar, Chennai",₹1.05 Cr,"Manthope Colony, Ashok Nagar,Chennai",960,10940,3,Yes
401,"Akarsh flats,Anthony Nagar, Kolathur,Chennai","2 BHK Flat for sale in Kolathur, Chennai",₹65.0 L,"Akarsh flats,Anthony Nagar, Kolathur,Chennai",932,6970,3,No
441,Adithi Homes,"2 BHK Flat for sale in Maduravoyal, Chennai",₹55.0 L,"Adayalampet, Maduravoyal,Chennai",840,6550,3,No
479,Geetham Heritage,"3 BHK Flat for sale in Thiruverkkadu, Chennai",₹72.0 L,"Arjunamedu, Thiruverkkadu,Chennai",1439,5000,3,No
...,...,...,...,...,...,...,...,...
13969,"Kamp Dwarka Convention,Sector 28 Dwarka, New D...","1 BHK Flat for sale in Sector 28 Dwarka, New D...",₹33.0 L,"Kamp Dwarka Convention,Sector 28 Dwarka, New D...",425,7760,2,No
13980,"Sonia Vihar Extension, Sonia Vihar,New Delhi",2 BHK Independent House for sale in Sonia Viha...,₹17.0 L,"Sonia Vihar Extension, Sonia Vihar,New Delhi",600,2830,2,No
14007,Classic Apartment,"5 BHK Flat for sale in Sector 12 Dwarka, New D...",₹6.5 Cr,"Sector 12 Dwarka, New Delhi",4500,14440,5,Yes
14190,Classic Apartment,"5 BHK Flat for sale in Sector 12 Dwarka, New D...",₹6.5 Cr,"Sector 12 Dwarka, New Delhi",4500,14440,5,Yes
14287,"Keshav Homes,Mundka Village, Mundka,New Delhi","2 BHK Flat for sale in Mundka, New Delhi",₹32.0 L,"Keshav Homes,Mundka Village, Mundka,New Delhi",891,3590,3,No

In [28]:
# 5) Drop Duplicates
df.drop_duplicates(inplace = True)
df

,Property Title,Location,Total_Area,Price_per_SQFT,Baths,Balcony,Price_in_Cr,BHK_Type,Property_Type,Locality,City
0,"4 BHK Flat for sale in Kanathur Reddikuppam, C...","Kanathur Reddikuppam, Chennai",2583,7700,4,Yes,1.99,4 BHK,Flat,Kanathur Reddikuppam,Chennai
1,10 BHK Independent House for sale in Pozhichal...,"Ramanathan Nagar, Pozhichalur,Chennai",7000,3210,6,Yes,2.25,10 BHK,Independent House,"Ramanathan Nagar, Pozhichalur",Chennai
2,"3 BHK Flat for sale in West Tambaram, Chennai","Kasthuribai Nagar, West Tambaram,Chennai",1320,7580,3,No,1.00,3 BHK,Flat,"Kasthuribai Nagar, West Tambaram",Chennai
3,7 BHK Independent House for sale in Triplicane...,"Naveenilaya,Chepauk, Triplicane,Chennai",4250,7840,5,Yes,3.33,7 BHK,Independent House,"Naveenilaya,Chepauk, Triplicane",Chennai
4,"2 BHK Flat for sale in Avadi, Chennai","Avadi, Chennai",960,5000,3,Yes,0.48,2 BHK,Flat,Avadi,Chennai
...,...,...,...,...,...,...,...,...,...,...,...
14523,"2 BHK Flat for sale in Tilak Nagar, New Delhi","Krishna Park Extension, Tilak Nagar,New Delhi",1053,3800,3,Yes,0.40,2 BHK,Flat,"Krishna Park Extension, Tilak Nagar",New Delhi
14524,1 BHK Independent House for sale in Jaffarpur ...,"Rawta, Jaffarpur Kalan,New Delhi",472,2970,2,Yes,0.14,1 BHK,Independent House,"Rawta, Jaffarpur Kalan",New Delhi
14525,"1 BHK Flat for sale in Geeta Colony, New Delhi","Rani Garden, Geeta Colony,New Delhi",378,7940,1,Yes,0.30,1 BHK,Flat,"Rani Garden, Geeta Colony",New Delhi
14526,"3 BHK Flat for sale in Sector 16 Rohini, New D...","Lig flat rohini,Sector 16E, Sector 16 Rohini,N...",700,8570,2,Yes,0.60,3 BHK,Flat,"Lig flat rohini,Sector 16E, Sector 16 Rohini",New Delhi
14527,1 RK Independent House for sale in Sector 3 Ro...,"Sector 3B, Sector 3 Rohini,New Delhi",344,15990,1,Yes,0.55,1 BK,Independent House,"Sector 3B, Sector 3 Rohini",New Delhi

In [15]:
# 6) Numerical summary
df.describe()

         Total_Area  Price_per_SQFT         Baths
count  14528.000000    14528.000000  14528.000000
mean    1297.916988    11719.456222      2.751239
std     1245.694305    49036.068632      0.898243
min       70.000000        0.000000      1.000000
25%      650.000000     4480.000000      2.000000
50%     1000.000000     6050.000000      3.000000
75%     1439.000000     9312.500000      3.000000
max    35000.000000   999000.000000      6.000000

In [16]:
# 7) Correlation matrix for numeric columns
df.corr(numeric_only=True)

                Total_Area  Price_per_SQFT     Baths
Total_Area        1.000000        0.153151  0.529589
Price_per_SQFT    0.153151        1.000000  0.005869
Baths             0.529589        0.005869  1.000000

In [17]:
# 8) Skewness and kurtosis — to understand data distribution
print(df.skew(numeric_only=True))
df.kurtosis(numeric_only=True)

Total_Area         5.940778
Price_per_SQFT    15.089859
Baths              0.592657
dtype: float64

Total_Area         76.095474
Price_per_SQFT    244.366227
Baths               1.603218
dtype: float64

In [19]:
# 9) Function to convert price strings to Cr (Crores)

def convert_price_to_cr(price):
    """
    Converts price strings like:
      ₹48 L  →  0.48
      ₹1.5 Cr → 1.5
      80 Lakh → 0.8
      2 Crores → 2
    Returns price in Cr (float)
    """
    if pd.isna(price):
        return np.nan
    
    # Convert to string and clean
    price = str(price).replace("₹", "").replace(",", "").strip().lower()
    price = price.replace("lakhs", "l").replace("lakh", "l").replace("crores", "cr").replace("crore", "cr")
    
    # Extract numeric part
    numbers = re.findall(r"[0-9]*\.?[0-9]+", price)
    if not numbers:
        return np.nan
    
    value = float(numbers[0])
    
    # Convert based on unit
    if "cr" in price:
        return value
    elif "l" in price:
        return value / 100
    
# Apply conversion
df["Price_in_Cr"] = df["Price"].apply(convert_price_to_cr)

# Convert dtype to float
df["Price_in_Cr"] = df["Price_in_Cr"].astype("float")

In [20]:
# Drop the old Price column
df.drop(columns=["Price"], inplace=True)

print(df.dtypes)
df.head()

Name               object
Property Title     object
Location           object
Total_Area          int64
Price_per_SQFT      int64
Baths               int64
Balcony            object
Price_in_Cr       float64
dtype: object

,Name,Property Title,Location,Total_Area,Price_per_SQFT,Baths,Balcony,Price_in_Cr
0,Casagrand ECR 14,"4 BHK Flat for sale in Kanathur Reddikuppam, C...","Kanathur Reddikuppam, Chennai",2583,7700,4,Yes,1.99
1,"Ramanathan Nagar, Pozhichalur,Chennai",10 BHK Independent House for sale in Pozhichal...,"Ramanathan Nagar, Pozhichalur,Chennai",7000,3210,6,Yes,2.25
2,DAC Prapthi,"3 BHK Flat for sale in West Tambaram, Chennai","Kasthuribai Nagar, West Tambaram,Chennai",1320,7580,3,No,1.00
3,"Naveenilaya,Chepauk, Triplicane,Chennai",7 BHK Independent House for sale in Triplicane...,"Naveenilaya,Chepauk, Triplicane,Chennai",4250,7840,5,Yes,3.33
4,VGN Spring Field Phase 1,"2 BHK Flat for sale in Avadi, Chennai","Avadi, Chennai",960,5000,3,Yes,0.48

In [21]:
# Drop the Name column
df.drop(columns=["Name"], inplace=True)

In [22]:
df.loc[df['Price_in_Cr'].isnull()]

df.drop(index=df.loc[df['Price_in_Cr'].isnull()].index, inplace=True)

In [23]:
# 10) Extract BHK Type from Property Title

PATTERN = re.compile(
    r"\b(?P<num>\d+(?:\.\d+)?(?:\+?)?)\s*(?P<unit>BHK|BH|BK|B|RH|RK|R)\b",
    flags=re.IGNORECASE
)

def extract_bhk_type(title: str):
    s = str(title)
    m = PATTERN.search(s)
    if not m:
        return None
    num  = m.group("num").replace(" ", "")
    unit = m.group("unit").upper()
    # normalize units
    unit_norm = {
        "R": "B",        
        "RK": "BK",   
        "RH":"BH"
    }.get(unit, unit)       # keep BHK/RK/R as-is
    return f"{num} {unit_norm}"

df["BHK_Type"] = df["Property Title"].astype(str).apply(extract_bhk_type)

df["BHK_Type"].unique()

array(['4 BHK', '10 BHK', '3 BHK', '7 BHK', '2 BHK', '1 BHK', '6 BHK',
       '5 BHK', '1 BK', '8 BHK', '1.5 BHK', '2.5 BHK', '9 BHK', '3.5 BHK',
       '5+ BHK', None, '6 BK', '10.5 BHK', '4.5 BHK', '9.5 BHK',
       '8.5 BHK', '7.5 BHK', '5 BK', '1 B', '2 BK', '3 BK', '4 BK',
       '2 BH', '3 B'], dtype=object)

In [24]:
# 11) Extract Property Type from Property Title

def extract_property_type(title, location=None):
    # Convert to lowercase string
    title = str(title).lower()

    pattern = re.compile(
        r"^\s*\d+(?:\.\d+)?\+?\s*(?:BHK|RK|R|B|BH|BK|RH)\b[\s-]*",
        flags=re.IGNORECASE
    )

    # Substitute the matched part (and everything before it) with an empty string
    title = re.sub(pattern, "", title).strip()
    
    # Remove everything after any comma or connector word
    title = re.sub(r"(\b(for)\b).*", "", title)

    # Capitalize properly
    return title.title().strip() if title else None


# Apply to DataFrame
df["Property_Type"] = df.apply(
    lambda row: extract_property_type(row["Property Title"], row["Location"]),
    axis=1
)

df["Property_Type"].unique()

array(['Flat', 'Independent House', 'Villa', 'Studio Flat', 'Shop Flat',
       'Studio Independent House'], dtype=object)

In [25]:
# 11) Split Location into Locality and City

df["Locality"] = df["Location"].astype(str).apply(lambda x: x.rsplit(",", 1)[0].strip() if "," in x else x.strip())
df["City"] = df["Location"].astype(str).apply(lambda x: x.rsplit(",", 1)[1].strip() if "," in x else None)

df["City"].unique()

array(['Chennai', 'Bangalore', 'Hyderabad', 'Mumbai', 'Thane', 'Kolkata',
       'Pune', 'New Delhi'], dtype=object)

In [26]:
# Convert Thane to Mumbai in City column
df.loc[df["City"] == "Thane", "City"] = "Mumbai"

In [29]:
print(df.info())
print(df.shape)
print(df.dtypes)
df.describe()

<class 'pandas.core.frame.DataFrame'>
Index: 14318 entries, 0 to 14527
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Property Title  14318 non-null  object
 1   Location        14318 non-null  object
 2   Total_Area      14318 non-null  int64
 3   Price_per_SQFT  14318 non-null  int64
 4   Baths           14318 non-null  int64
 5   Balcony         14318 non-null  object
 6   Price_in_Cr     14318 non-null  float64
 7   BHK_Type        14306 non-null  object
 8   Property_Type   14318 non-null  object
 9   Locality        14318 non-null  object
 10  City            14318 non-null  object
dtypes: float64(1), int64(3), object(7)
memory usage: 1.3+ MB
None
(14318, 11)
Property Title     object
Location           object
Total_Area          int64
Price_per_SQFT      int64
Baths               int64
Balcony            object
Price_in_Cr       float64
BHK_Type           object
Property_Type      object
Locality           object
City               object
dtype: object

         Total_Area  Price_per_SQFT         Baths   Price_in_Cr
count  14318.000000    14318.000000  14318.000000  14318.000000
mean    1298.100293    11773.365694      2.748079      1.068925
std     1251.708140    49357.499006      0.899594      1.876820
min       70.000000     1000.000000      1.000000      0.010000
25%      650.000000     4490.000000      2.000000      0.370000
50%     1000.000000     6060.000000      3.000000      0.650000
75%     1432.000000     9330.000000      3.000000      1.140000
max    35000.000000   999000.000000      6.000000     84.000000

In [31]:
# City-wise breakdown

city_breakdown = (
    df.groupby("City")
    .agg(
        Listings=("City", "count"),                       # number of properties
        Avg_Price_Crores=("Price_in_Cr", "mean"),          # average price
        Median_Price_Crores=("Price_in_Cr", "median"),     # median price
        Avg_Price_per_SQFT=("Price_per_SQFT", "mean")     # average price per sqft
    )
    .sort_values("Avg_Price_Crores", ascending=False).reset_index()
)

city_breakdown

,City,Listings,Avg_Price_Crores,Median_Price_Crores,Avg_Price_per_SQFT
0,Mumbai,1349,1.471453,0.90,20849.229059
1,New Delhi,2126,1.316524,0.62,15399.275635
2,Hyderabad,532,1.246700,0.84,8250.695489
3,Bangalore,4406,1.227234,0.78,11539.559691
4,Chennai,1575,0.956631,0.59,8149.841270
5,Pune,2946,0.680300,0.43,9174.501018
6,Kolkata,1384,0.678946,0.43,9111.148844

In [32]:
# Property Type-wise breakdown

property_type_breakdown = (
    df.groupby("Property_Type")
    .agg(
        Listings=("Property_Type", "count"),                       # number of properties
        Avg_Price_Crores=("Price_in_Cr", "mean"),          # average price
        Median_Price_Crores=("Price_in_Cr", "median"),     # median price
        Avg_Price_per_SQFT=("Price_per_SQFT", "mean")     # average price per sqft
    )
    .sort_values("Avg_Price_Crores", ascending=False).reset_index()
)

property_type_breakdown

,Property_Type,Listings,Avg_Price_Crores,Median_Price_Crores,Avg_Price_per_SQFT
0,Studio Independent House,4,2.455625,1.48,6467.500000
1,Villa,666,2.104255,1.00,19356.096096
2,Independent House,4106,1.528343,0.90,17757.396493
3,Flat,9534,0.798796,0.55,8575.393329
4,Studio Flat,7,0.338571,0.22,138672.857143
5,Shop Flat,1,0.150000,0.15,13640.000000

In [33]:
# City and Property Type breakdown

city_property_type_breakdown = (
    df.groupby(["City", "Property_Type"])   
    .agg(
        Listings=("Property_Type", "count"),               # number of properties
        Avg_Price_Crores=("Price_in_Cr", "mean"),          # average price
        Median_Price_Crores=("Price_in_Cr", "median"),     # median price
        Avg_Price_per_SQFT=("Price_per_SQFT", "mean")     # average price per sqft
    )
    .sort_values(["City", "Avg_Price_Crores"], ascending=[True, False]).reset_index()
)

city_property_type_breakdown

,City,Property_Type,Listings,Avg_Price_Crores,Median_Price_Crores,Avg_Price_per_SQFT
0,Bangalore,Studio Independent House,4,2.455625,1.480,6467.500000
1,Bangalore,Villa,341,1.836693,1.100,25689.589443
2,Bangalore,Independent House,1732,1.620742,1.200,14761.333718
3,Bangalore,Flat,2329,0.843251,0.650,7080.571061
4,Chennai,Independent House,487,1.408572,0.800,12015.893224
5,Chennai,Villa,149,1.313144,0.750,6282.953020
6,Chennai,Flat,937,0.666745,0.520,6434.183565
7,Chennai,Studio Flat,1,0.170000,0.170,5630.000000
8,Chennai,Shop Flat,1,0.150000,0.150,13640.000000
9,Hyderabad,Villa,34,3.770882,2.440,10216.176471
10,Hyderabad,Independent House,79,1.808508,1.200,8943.037975
11,Hyderabad,Flat,419,0.935948,0.730,7960.668258
12,Kolkata,Villa,22,1.835000,1.100,6662.272727
13,Kolkata,Independent House,247,1.247915,0.850,28652.145749
14,Kolkata,Flat,1114,0.530445,0.385,4831.849192
15,Kolkata,Studio Flat,1,0.140000,0.140,3500.000000
16,Mumbai,Villa,18,3.961111,1.800,13563.333333
17,Mumbai,Independent House,147,1.508903,0.550,41310.204082
18,Mumbai,Flat,1181,1.431094,0.950,18408.526672
19,Mumbai,Studio Flat,3,0.586667,0.530,22800.000000
20,New Delhi,Villa,36,6.699303,1.700,17460.833333
21,New Delhi,Independent House,950,1.570578,0.650,20783.494737
22,New Delhi,Flat,1139,0.935581,0.580,10077.216857
23,New Delhi,Studio Flat,1,0.080000,0.080,888000.000000
24,Pune,Villa,66,1.491030,1.050,27700.000000
25,Pune,Independent House,464,1.330410,0.710,17010.775862
26,Pune,Flat,2415,0.533426,0.400,7164.265010
27,Pune,Studio Flat,1,0.220000,0.220,5180.000000

In [34]:
print(df.groupby("Property_Type")["Price_per_SQFT"].skew())

print(df.groupby("Property_Type")["Price_per_SQFT"].apply(lambda x: x.kurtosis()))

print(df.groupby("Property_Type")["Price_in_Cr"].skew())

print(df.groupby("Property_Type")["Price_in_Cr"].apply(lambda x: x.kurtosis()))

Property_Type
Flat                        28.754471
Independent House            9.760082
Shop Flat                         NaN
Studio Flat                  2.641395
Studio Independent House    -1.453404
Villa                        8.377219
Name: Price_per_SQFT, dtype: float64
Property_Type
Flat                        963.948808
Independent House           100.968525
Shop Flat                          NaN
Studio Flat                   6.982414
Studio Independent House      1.770357
Villa                        70.708981
Name: Price_per_SQFT, dtype: float64
Property_Type
Flat                         8.986616
Independent House           12.005947
Shop Flat                         NaN
Studio Flat                  0.616935
Studio Independent House     1.665772
Villa                        8.379756
Name: Price_in_Cr, dtype: float64
Property_Type
Flat                        191.877138
Independent House           277.988217
Shop Flat                          NaN
Studio Flat                  -1.291162
Studio Independent House      2.796663
Villa                       104.935091
Name: Price_in_Cr, dtype: float64

In [35]:
print(df.groupby("City")["Price_per_SQFT"].skew())

print(df.groupby("City")["Price_per_SQFT"].apply(lambda x: x.kurtosis()))

print(df.groupby("City")["Price_in_Cr"].skew())

print(df.groupby("City")["Price_in_Cr"].apply(lambda x: x.kurtosis()))

City
Bangalore    13.846797
Chennai      22.768762
Hyderabad    22.419804
Kolkata      14.054442
Mumbai       14.949900
New Delhi    12.973602
Pune         16.805397
Name: Price_per_SQFT, dtype: float64
City
Bangalore    204.404277
Chennai      546.196737
Hyderabad    511.471291
Kolkata      201.972020
Mumbai       243.855319
New Delhi    178.677188
Pune         312.094316
Name: Price_per_SQFT, dtype: float64
City
Bangalore    20.329597
Chennai       4.954273
Hyderabad     6.566478
Kolkata       5.842179
Mumbai        5.969890
New Delhi     9.720655
Pune         16.588885
Name: Price_in_Cr, dtype: float64
City
Bangalore    713.354396
Chennai       35.917905
Hyderabad     68.866047
Kolkata       53.690464
Mumbai        56.444657
New Delhi    159.177257
Pune         405.568179
Name: Price_in_Cr, dtype: float64

In [36]:
print(df.groupby(["City","Property_Type"])["Price_per_SQFT"].skew())

print(df.groupby(["City","Property_Type"])["Price_per_SQFT"].apply(lambda x: x.kurtosis()))

print(df.groupby(["City","Property_Type"])["Price_in_Cr"].skew())

print(df.groupby(["City","Property_Type"])["Price_in_Cr"].apply(lambda x: x.kurtosis()))

City       Property_Type
Bangalore  Flat                        31.299334
           Independent House           11.072255
           Studio Independent House    -1.453404
           Villa                        6.649869
Chennai    Flat                         5.625273
           Independent House           12.807943
           Shop Flat                         NaN
           Studio Flat                       NaN
           Villa                        2.710629
Hyderabad  Flat                        20.383752
           Independent House            5.713675
           Villa                        0.789256
Kolkata    Flat                         2.123182
           Independent House            5.772126
           Studio Flat                       NaN
           Villa                        1.561132
Mumbai     Flat                         6.970832
           Independent House            5.239182
           Studio Flat                  0.725966
           Villa                        3.776334
New Delhi  Flat                        19.228199
           Independent House           10.210772
           Studio Flat                       NaN
           Villa                        1.971220
Pune       Flat                        25.216789
           Independent House            9.315195
           Studio Flat                       NaN
           Villa                        5.574078
Name: Price_per_SQFT, dtype: float64
City       Property_Type
Bangalore  Flat                        1018.989185
           Independent House            136.629550
           Studio Independent House       1.770357
           Villa                         43.274751
Chennai    Flat                          63.355050
           Independent House            170.394792
           Shop Flat                           NaN
           Studio Flat                         NaN
           Villa                          9.566723
Hyderabad  Flat                         416.651705
           Independent House             38.782429
           Villa                          0.226331
Kolkata    Flat                           6.755228
           Independent House             32.695825
           Studio Flat                         NaN
           Villa                          3.401977
Mumbai     Flat                         123.889233
           Independent House             27.018739
           Studio Flat                         NaN
           Villa                         15.159312
New Delhi  Flat                         388.187928
           Independent House            109.449344
           Studio Flat                         NaN
           Villa                          3.480158
Pune       Flat                         715.617976
           Independent House             93.315341
           Studio Flat                         NaN
           Villa                         31.768048
Name: Price_per_SQFT, dtype: float64
City       Property_Type
Bangalore  Flat                        16.866170
           Independent House           20.241657
           Studio Independent House     1.665772
           Villa                        7.068512
Chennai    Flat                         3.575434
           Independent House            3.767307
           Shop Flat                         NaN
           Studio Flat                       NaN
           Villa                        3.001871
Hyderabad  Flat                         3.801879
           Independent House            1.737289
           Villa                        2.709428
Kolkata    Flat                         5.230669
           Independent House            3.489655
           Studio Flat                       NaN
           Villa                        3.806174
Mumbai     Flat                         4.093588
           Independent House            5.483370
           Studio Flat                  1.620549
           Villa                        2.990884
New Delhi  Flat                         3.629752
           Independent House            5.204008
           Studio Flat                       NaN
           Villa                        3.674932
Pune       Flat                         6.291675
           Independent House            8.721304
           Studio Flat                       NaN
           Villa                        1.947240
Name: Price_in_Cr, dtype: float64
City       Property_Type
Bangalore  Flat                        482.276224
           Independent House           607.660838
           Studio Independent House      2.796663
           Villa                        68.333856
Chennai    Flat                         17.537335
           Independent House            19.884009
           Shop Flat                          NaN
           Studio Flat                        NaN
           Villa                         9.687500
Hyderabad  Flat                         24.975825
           Independent House             2.545716
           Villa                         9.718463
Kolkata    Flat                         44.500276
           Independent House            17.691224
           Studio Flat                        NaN
           Villa                        16.149181
Mumbai     Flat                         26.201143
           Independent House            36.348520
           Studio Flat                        NaN
           Villa                        10.313302
New Delhi  Flat                         20.313092
           Independent House            35.396421
           Studio Flat                        NaN
           Villa                        16.471478
Pune       Flat                         69.244262
           Independent House            96.024733
           Studio Flat                        NaN
           Villa                         3.945352
Name: Price_in_Cr, dtype: float64

In [40]:
df.reset_index(drop=True)

,Property Title,Location,Total_Area,Price_per_SQFT,Baths,Balcony,Price_in_Cr,BHK_Type,Property_Type,Locality,City
0,"4 BHK Flat for sale in Kanathur Reddikuppam, C...","Kanathur Reddikuppam, Chennai",2583,7700,4,Yes,1.99,4 BHK,Flat,Kanathur Reddikuppam,Chennai
1,10 BHK Independent House for sale in Pozhichal...,"Ramanathan Nagar, Pozhichalur,Chennai",7000,3210,6,Yes,2.25,10 BHK,Independent House,"Ramanathan Nagar, Pozhichalur",Chennai
2,"3 BHK Flat for sale in West Tambaram, Chennai","Kasthuribai Nagar, West Tambaram,Chennai",1320,7580,3,No,1.00,3 BHK,Flat,"Kasthuribai Nagar, West Tambaram",Chennai
3,7 BHK Independent House for sale in Triplicane...,"Naveenilaya,Chepauk, Triplicane,Chennai",4250,7840,5,Yes,3.33,7 BHK,Independent House,"Naveenilaya,Chepauk, Triplicane",Chennai
4,"2 BHK Flat for sale in Avadi, Chennai","Avadi, Chennai",960,5000,3,Yes,0.48,2 BHK,Flat,Avadi,Chennai
...,...,...,...,...,...,...,...,...,...,...,...
14313,"2 BHK Flat for sale in Tilak Nagar, New Delhi","Krishna Park Extension, Tilak Nagar,New Delhi",1053,3800,3,Yes,0.40,2 BHK,Flat,"Krishna Park Extension, Tilak Nagar",New Delhi
14314,1 BHK Independent House for sale in Jaffarpur ...,"Rawta, Jaffarpur Kalan,New Delhi",472,2970,2,Yes,0.14,1 BHK,Independent House,"Rawta, Jaffarpur Kalan",New Delhi
14315,"1 BHK Flat for sale in Geeta Colony, New Delhi","Rani Garden, Geeta Colony,New Delhi",378,7940,1,Yes,0.30,1 BHK,Flat,"Rani Garden, Geeta Colony",New Delhi
14316,"3 BHK Flat for sale in Sector 16 Rohini, New D...","Lig flat rohini,Sector 16E, Sector 16 Rohini,N...",700,8570,2,Yes,0.60,3 BHK,Flat,"Lig flat rohini,Sector 16E, Sector 16 Rohini",New Delhi
14317,1 RK Independent House for sale in Sector 3 Ro...,"Sector 3B, Sector 3 Rohini,New Delhi",344,15990,1,Yes,0.55,1 BK,Independent House,"Sector 3B, Sector 3 Rohini",New Delhi

In [ ]:
df["Locality1"] = df["Locality"].astype(str).apply(lambda x: x.rsplit("-", 1)[1].strip() if "-" in x else x.strip())

In [ ]:
# Calculate expected price in crores
df['expected_price_cr'] = round((df['total_area'] * df['price_per_SQFT']) / 10000000, 2)

# Calculate difference
df['r'] = round(df['expected_price_cr'] - df['price_in_cr'], 2)

# Filter rows where the difference > 0.01 or < -0.01
mismatch_df = df[(df['r'] > 0.01) | (df['r'] < -0.01)]

print(mismatch_df)

In [ ]:
df.drop(columns=['Price_in_Cr', 'r'], inplace=True)

In [ ]:
df.to_csv("cleaned_real_estate.csv", index=False)